var app = new Vue({
  el: '#app',
  data:{
    newsHtml: '',
    newsArray:[
      {
        'newsId': '1001',
        'newsHtml':'<h1>人工智能与物联网装置相配合 方可创造整合服务商机</h1>\n' +
        '<p><img src="https://p3.pstatp.com/large/39b50002935afb756f6b" img_width="600" img_height="400" alt="人工智能与物联网装置相配合 方可创造整合服务商机" inline="0"></p><p>▲图说: 微软在22日正式宣布第五代人工智能聊天语音助理小冰上线，并正式跨入物联网(IoT)控制应用领域，与小米物联网平台合作，使用者将可透过与小冰对话方式，控制小米米家平台上的35款智能设备。图取自微软五代小冰网页</p><p>8月22日，微软在北京举办发布会，宣布人工智能聊天机器人第五代微软小冰正式推出，并跨入物联网应用领域。微软表示小冰已经与小米物联网平台合作，透过具有EQ的对谈方式，小米米家平台上的35款智能设备，都能透过第五代微软小冰进行自动控制，而不再需要使用专属物联网设备控制App。</p><p>被昵称为小冰之父的微软(亚洲)互联网工程院资深总监李笛表示，第五代微软小冰提供高级感官功能，可具备全双工语音识别，具备流体视觉辨识能力；除此之外，并全面采用监督式机器学习方法 (Supervised Machine Learning) 当中的生成模型 (Generative Model) 技术，可以提供情绪识别、兴趣分析、情感策略与响应等具有EQ特性的讯息响应能力，更能进一步分析使用者的各类兴趣，提供多达57种情感策略与响应模式，让整个对话过程更具有情感，而不只是单纯的大数据数据库响应，甚至可以拨电话给用户，直接进行语音对话。</p><p><strong>对话服务人工智能化 创造AI服务真实收入</strong></p><p>许多机构对于人工智能可能带来的商业利益感到质疑，对此，微软在之前就曾经发表过两个小冰商业化的实际案例。</p><p>首先是以日本连锁超商通路LAWSON为例，透过导入日本版小冰对话式服务，并在对话当中导入LAWSON实体通路的店内服务，整个在线转线下的转化率超过50%，而之前使用其他方式的服务导购方式，转化率仅有8%。</p><p>另一个案例，则是小冰在中国为内容提供商提供微信与微博公众号的代管服务，目前已经有10%的媒体、自媒体公众号是由小冰提供代管服务。</p><p>微软在发表会当中也提到，他们认为智能喇叭之类的产品情境其实不太实用，因为有很多功能透过手机搭配相关App就能提供，不需要为了特定功能而购买智能喇叭，甚至表示透过利用智能喇叭进行在线购物的活动似乎不太合理。</p><p><strong>将物联网装置当作是AI服务载体 方可创造真实营收</strong></p><p>就市场现况来看，包括运动手环、运动手表、高尔夫球表之类受到消费者喜欢的物联网装置，并不是因为该物联网装置在硬件上面规格有很特别，而是搭配该物联网设备的App软件与云端服务能提供相当完整的分析资料与建议，可以让消费者有感觉；而包括Amazon Echo、Google Home之类的智能喇叭，则是让消费者可以在不拿起手机的情况下，执行行事历规划与路程安排相关工作，甚至是直接购买Sportify之类的在线音乐服务，并透过喇叭进行播放，而不是透过手机。</p><p>因此，只要厂商提供能让消费者有感的AI服务，并依照应用情境提供洽当的物联网设备，就可以把虚无飘渺的藏身在云端的AI服务，透过物联网设备的销售，而让消费者愿意花钱买单(服务)，也才能够让厂商的AI服务可以获得收入，甚至导入订阅式服务，让厂商可以获得除了第一次产品销售之外的每月固定收入。</p><hr><p><strong>关于我们：网站内容更精彩！</strong></p><p>物联之家（www.iothome.com）物联网科技新媒体。我们关注物联网领域的价值发现和趋势，关注该领域的大小公司和大小人物，这里有跟物联网相关的深度观点、测评和剖析。物联网改变世界，我们将参与和忠实的记录改变的过程，见证物联网带给人类的丰硕成果。</p>'
      },
      {
        'newsId': '1002',
        'newsHtml':'<h1>小米note3周一发布，骁龙660，面部解锁，价格1999</h1>\n' +
            '<p>小米将于下周一发布小米MIX2全面屏手机，同时也将发布小米Note3。说起小米Note系列手机，我们基本可以用“命运多舛、恨不逢时”来形容。从小米Note到小米Note2，这个系列的小米手机特点是大屏、做工精美、颜值较高。</p><p><img src="https://p9.pstatp.com/large/39b70001317c89370602" img_width="1252" img_height="774" alt="小米note3周一发布，骁龙660，面部解锁，价格1999" inline="0"></p><p class="pgc-img-caption">小米Note</p><p>然而比较遗憾的是小米Note赶上了高通最失败的骁龙810处理器，小米Note标准版只能采用骁龙801。受此影响，本应该大卖的小米Note手机结果是销售平平。</p><p><img src="https://p3.pstatp.com/large/39b0000334e4c41f1033" img_width="1485" img_height="1006" alt="小米note3周一发布，骁龙660，面部解锁，价格1999" inline="0"></p><p class="pgc-img-caption">小米Note2</p><p>去年小米又发布了小米Note2，这款手机也是小米第一款曲面屏手机，手机颜值较高，笔者非常喜欢这款手机。但其与小米MIX手机同时发布，完全被忽视。最关键是小米Note2采用了定制版LG曲面屏，初期产能极低屏幕显示效果也很一般，导致这款手机初期基本没货，现在有货难卖的尴尬局面。</p><p><img src="https://p3.pstatp.com/large/39ad0003107bcf375d0f" img_width="913" img_height="633" alt="小米note3周一发布，骁龙660，面部解锁，价格1999" inline="0"></p><p class="pgc-img-caption">小米Note3概念图</p><p>好在小米Note3即将发布了，那么小米Note3会不会重蹈前两代的命运呢？笔者认为小米Note3手机会一改前两代手机的颓势，将成为一款比小米6手机更热卖的手机，原因如下：</p><h1>处理器</h1><p>现在基本确定小米Note3将采用与OPPO R11同款的骁龙660处理器，这款处理器采用14纳米工艺，性能虽不比骁龙835，但主频相差不多，对于玩一般游戏和跑应用足足够用。</p><h1>外观颜值</h1><p>小米Note3是“大号版小米6”，机身采用四曲面玻璃（或许还有陶瓷版），5.5寸护眼屏幕。用过小米6手机的网友都知道，机身做工流光溢彩，看起来非常漂亮，感觉要比OPPO R11更漂亮。</p><p><img src="https://p1.pstatp.com/large/39b600014f4f401df17d" img_width="913" img_height="609" alt="小米note3周一发布，骁龙660，面部解锁，价格1999" inline="0"></p><p class="pgc-img-caption">小米6背面</p><h1>拍照能力</h1><p>小米Note3将采用1600万前美颜相机，号称自拍更美。后与小米6同款双摄像头，光学变焦、光学防抖、背景虚化拍人像更好，总结各种拍照参数，其拍照能力应该有与OPPO R11相同。</p><p><img src="https://p3.pstatp.com/large/39ad000310e9d9708611" img_width="638" img_height="740" alt="小米note3周一发布，骁龙660，面部解锁，价格1999" inline="0"></p><h1>续航</h1><p>小米Note3很可能采用4000+毫安电池，续航能力强劲，事实上笔者比较喜欢小米Note2的原因就是续航能力。</p><h1>价格</h1><p>小米Note3的手机售价基本确定为1999起，相比OPPO R11的2999要良心太多。现在手机原材料上涨，小米手机仍在持续高性价比策略，需要自信和胆略。</p><p><img src="https://p3.pstatp.com/large/39b700013281a6b75a58" img_width="913" img_height="633" alt="小米note3周一发布，骁龙660，面部解锁，价格1999" inline="0"></p><p class="pgc-img-caption">OPPO R11</p><h1>黑科技</h1><p>小米Note3将在小米手机上首次实现面部识别解锁的黑科技技术，识别率较高，解锁速度很快。</p><p><img src="https://p3.pstatp.com/large/39b500031366140cedd5" img_width="588" img_height="323" alt="小米note3周一发布，骁龙660，面部解锁，价格1999" inline="0"></p><h1>总结</h1><p>小米Note3继承了小米6手机的所有优点，并增加了面部识别解锁黑科技，价格仅1999起，如此配置和价格，基本可以秒杀OPPO R11，不知道OPPO R11怎么看？</p>'
      },
      {
        'newsId': '1003',
        'newsHtml':'<h1>小米6与王者荣耀还能碰撞出什么样火花</h1>\n' +
        '        <p>\n' +
        '          NEST2017高通骁龙大众选拔赛-王者荣耀组的现场，眼尖的玩家们都留意到了比赛区前方设置的骁龙战机展示区。展示区中包含了大量采用高通骁龙835移动平台的手机，而在其中小米6则是被用户们关注最多的手机之一。\n' +
        '        </p>\n' +
        '        <img src="https://p3.pstatp.com/large/314b000cb7ba7df7d456" class="img-responsive">\n' +
        '        <p>\n' +
        '          王者老司机们一定都会知道手机支持高帧率模式有多么重要，那感觉与普通状态下的《王者荣耀》绝对不是一个游戏。而小米6在刚发布不久，便成为支持高帧率模式名单中的一员，从而被不少玩家们所喜爱，进而成为王者荣耀道路上的战斗伙伴。\n' +
        '        </p>\n' +
        '        <img src="https://p3.pstatp.com/large/314f00062ca568a516ba" class="img-responsive">\n' +
        '        <p>\n' +
        '          之所以迅速入选王者荣耀高帧率名单，原因在于小米6搭载了高通骁龙835移动平台，作为目前安卓上性能最强的移动平台，骁龙835在各个方面均大幅领先，在游戏方面，以最火的《王者荣耀》为代表，骁龙835移动平台强大的Kryo 280 CPU和Adreno 540GPU性能是王者荣耀流畅运行的重要保证，不会因为画质高而卡顿，并且在稳定60帧的高帧率模式能够带来更流畅的观感，使得玩家们能够更上一层楼。\n' +
        '        </p>\n' +
        '        <img src="https://p3.pstatp.com/large/314f00062ca613715f3e" class="img-responsive">\n' +
        '        <p>\n' +
        '          游戏玩的舒服不止是性能，由于玩游戏时长期握持手机，手机发热成为了另外一个非常影响游戏体验的因素，很多手机长时间运行游戏产生了巨大的热量，甚至达到四十多度，小米6由于搭载了骁龙835移动平台，得益于其先进的10纳米制程工艺，在发热控制上做的非常出色，长时间游戏手机温度稍稍提高，仍然保持在正常范围内，避免了高温导致的游戏体验的下降。\n' +
        '        </p>\n' +
        '        <img src="https://p1.pstatp.com/large/3150000862ef545fccb5" class="img-responsive">\n' +
        '        <p>\n' +
        '          小米6使用了3250mah的大电池，同时也借助高通835移动平台优良的续航表现，在功耗方面令人甚为满意，重度游戏爱好者可以在游戏中尽情玩耍，不用担心电量，与其同时，小米6支持高通Quick Charge 3.0充电标准，充电速度更快。\n' +
        '        </p>\n' +
        '        <p>\n' +
        '          5.15英寸的屏幕，四曲面带来的更好握持感，小米6绝对是你在王者荣耀中的忠实战友。\n' +
        '        </p>\n' +
        '        <img src="https://p1.pstatp.com/large/314d00062d186454ecfb" class="img-responsive">\n' +
        '        <p>\n' +
        '          近期，在高通骁龙赞助的NEST2017高通骁龙大众选拔赛——王者荣耀组比赛中，小米6凭借优异的性能及表现成为现场比赛用机和奖品，现场玩家们可以亲手体验小米6在王者荣耀中的表现，高通骁龙835移动平台绝对会让你对安卓旗舰有新的认识。\n' +
        '        </p>'
      },
      {
        'newsId': '1004',
        'newsHtml': '<h1>为什么共享单车都没有后座？原来全都是套路！</h1>\n' +
        '<p>现在很多城市的街头角落都摆满了各种各样的共享单车，什么摩拜、ofo等等。但是大家有没有发现，这些共享单车都是没有后座的，这是为什么呢？</p><p><img src="https://p3.pstatp.com/large/39a60003491622bdb994" img_width="550" img_height="315" alt="为什么共享单车都没有后座？原来全都是套路！" inline="0"></p><p>其实主要有以下几个原因：</p><p>首先共享单车的一个利益来源是押金，如果有后座的话，本来每人一辆车的，就变成了两个人可以同时使用一个车。注册的人数将会减少，收益也将会减少。</p><p><img src="https://p1.pstatp.com/large/39a8000139466cbf582e" img_width="640" img_height="443" alt="为什么共享单车都没有后座？原来全都是套路！" inline="0"></p><p>另一方面，共享单车有后座将会增加成本，虽然每辆车多一个后座也没多多少钱，但投放的车辆数量巨大，也是一笔大费用。而且从目前的情况来看，共享单车的损坏率挺高的，如果加了后座之后单车的损坏率自然也会增高。</p><p>此外，共享单车有后座也会降低安全性能，两人同坐一辆车也增加了操作难度，危险会大很多。</p><p><img src="https://p1.pstatp.com/large/39a50003480b4e2bf2c7" img_width="600" img_height="346" alt="为什么共享单车都没有后座？原来全都是套路！" inline="0"></p><p>其实说白了都是钱的问题，哪个商家会做亏本生意呢。</p>'
      }
    ]
  },
  methods: {
    initProcess: function () {
      var queryNewId = $('#hidden-newsId').val();
      var content = '';

      for(var index = 0; index < this.newsArray.length; index++){
        if(this.newsArray[index].newsId === queryNewId){
          this.newsHtml = this.newsArray[index].newsHtml;
          return false;
        }
      }
    }
  },
  mounted: function () {
    this.initProcess();
  }

});